#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_UAT/SECONDARY_SOURCE"]: Refreshing state... [id=moh_applications/client/a6111e23-097e-4f61-9c25-9343b0efd796/scope-mappings/045f3224-9637-4785-a661-fc6f028804d2/7da1617b-2d92-4c2c-8981-dd7151a76a85]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_UAT/DSR_USER"]: Refreshing state... [id=d106947f-49e5-4b46-aa82-ee64ad314736/fcb22564-e254-4bb2-8ebf-4596a1ab1330]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-SHOPPERS.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_UAT/CONSUMER"]: Refreshing state... [id=daf9d1e7-bea6-4eb7-9ce5-26ef14ee10e0/d8799ef3-97b8-4f85-8f04-fb39cc8b813a]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_CONF/DSR_USER"]: Refreshing state... [id=d106947f-49e5-4b46-aa82-ee64ad314736/6c3b9d2b-e51e-4e47-a698-3597ca4e19a2]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_IAT/DSR_USER"]: Refreshing state... [id=d106947f-49e5-4b46-aa82-ee64ad314736/08f14258-e522-4116-ae91-9cdda9ada3e9]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_REV/DSR_USER"]: Refreshing state... [id=d106947f-49e5-4b46-aa82-ee64ad314736/41a5dd49-9708-482b-b789-d79f46e573a0]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_SIT/DSR_USER"]: Refreshing state... [id=d106947f-49e5-4b46-aa82-ee64ad314736/c31af1e0-f13b-4505-8b55-c437fdacffb5]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-MOH-APPROVER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_UAT/MOH_APPROVER"]: Refreshing state... [id=6b3b0e63-2bff-4f50-9e76-8bb40e3859cc/779c5ea7-5c9a-486f-ad8f-4fa2d1d8d365]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-MOH-APPROVER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_CONF/MOH_APPROVER"]: Refreshing state... [id=6b3b0e63-2bff-4f50-9e76-8bb40e3859cc/37f6a73b-4640-412c-ac9f-ca9417b769f7]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-MOH-APPROVER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_REV/MOH_APPROVER"]: Refreshing state... [id=6b3b0e63-2bff-4f50-9e76-8bb40e3859cc/0e63f5f5-a9b9-4b31-973c-2ecba829c3bb]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-MOH-APPROVER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_SIT/MOH_APPROVER"]: Refreshing state... [id=6b3b0e63-2bff-4f50-9e76-8bb40e3859cc/a365f662-fbca-4c9a-af4b-076a860933a8]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-MOH-APPROVER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_IAT/MOH_APPROVER"]: Refreshing state... [id=6b3b0e63-2bff-4f50-9e76-8bb40e3859cc/9aa82afd-7a6d-4dac-b5d6-033c12b36fa6]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-SECONDARY-SOURCE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_SIT/SECONDARY_SOURCE"]: Refreshing state... [id=moh_applications/client/ebf19db5-ab2e-4698-9a46-fa6b0138ab95/scope-mappings/1197df69-9199-49a5-a49a-c7d43d35551c/9c02e9eb-e774-4a31-8e43-3e54a54ea88f]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-SECONDARY-SOURCE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_UAT/SECONDARY_SOURCE"]: Refreshing state... [id=moh_applications/client/ebf19db5-ab2e-4698-9a46-fa6b0138ab95/scope-mappings/045f3224-9637-4785-a661-fc6f028804d2/7da1617b-2d92-4c2c-8981-dd7151a76a85]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-SECONDARY-SOURCE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_CONF/SECONDARY_SOURCE"]: Refreshing state... [id=moh_applications/client/ebf19db5-ab2e-4698-9a46-fa6b0138ab95/scope-mappings/c0fe2e9f-6937-4ffa-9296-d786d9b0a98b/dcc3f917-a5aa-46f1-a7f7-3e9ed6e0e5ad]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-SECONDARY-SOURCE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_IAT/SECONDARY_SOURCE"]: Refreshing state... [id=moh_applications/client/ebf19db5-ab2e-4698-9a46-fa6b0138ab95/scope-mappings/a837283e-f96e-446d-9c51-5ac7d0eab773/4e6fc50d-7fe8-4538-ac58-7871aea011b8]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-SECONDARY-SOURCE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_REV/SECONDARY_SOURCE"]: Refreshing state... [id=moh_applications/client/ebf19db5-ab2e-4698-9a46-fa6b0138ab95/scope-mappings/20e896f4-bf43-43ed-9441-d166e0513f34/5438b8e8-4948-4446-a083-531ec9654913]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-PRIMARY-SOURCE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_REV/PRIMARY_SOURCE"]: Refreshing state... [id=74af1232-8e9f-44e5-be27-0863f000291a/4b919d71-c76b-4621-be50-f05a7e8ed144]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-PRIMARY-SOURCE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_IAT/PRIMARY_SOURCE"]: Refreshing state... [id=74af1232-8e9f-44e5-be27-0863f000291a/895c4a65-e67d-4657-bba3-df5a1440fc58]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-PRIMARY-SOURCE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_SIT/PRIMARY_SOURCE"]: Refreshing state... [id=74af1232-8e9f-44e5-be27-0863f000291a/96650edd-ac15-4f9c-a27b-2be7231344bf]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-PRIMARY-SOURCE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_UAT/PRIMARY_SOURCE"]: Refreshing state... [id=74af1232-8e9f-44e5-be27-0863f000291a/9ce4e013-c2b7-4379-a46e-1c6b495803a6]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-PRIMARY-SOURCE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_CONF/PRIMARY_SOURCE"]: Refreshing state... [id=74af1232-8e9f-44e5-be27-0863f000291a/7430c88e-e4e4-4bbd-b262-d4c9bc3ba564]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-CONSUMER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_IAT/CONSUMER"]: Refreshing state... [id=b4c1e4bc-4bbd-4f37-966c-cc29bce30733/1251650d-4190-4cda-a00b-011cf1cbffc7]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-CONSUMER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_SIT/CONSUMER"]: Refreshing state... [id=b4c1e4bc-4bbd-4f37-966c-cc29bce30733/6578e80a-fbe5-4866-830d-76ac324c298c]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-CONSUMER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_UAT/CONSUMER"]: Refreshing state... [id=b4c1e4bc-4bbd-4f37-966c-cc29bce30733/d8799ef3-97b8-4f85-8f04-fb39cc8b813a]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-CONSUMER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_REV/CONSUMER"]: Refreshing state... [id=b4c1e4bc-4bbd-4f37-966c-cc29bce30733/d3dc70e8-af0e-4cb9-9e79-3706c94fd8da]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-CONSUMER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_CONF/CONSUMER"]: Refreshing state... [id=b4c1e4bc-4bbd-4f37-966c-cc29bce30733/52caf85e-e771-4fa4-8274-1afc8d170cd2]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-PRIMARY-SOURCE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_SIT/PRIMARY_SOURCE"]: Refreshing state... [id=moh_applications/client/3f1fc7bd-2f6b-43e8-8564-0e2276fc9f41/scope-mappings/1197df69-9199-49a5-a49a-c7d43d35551c/96650edd-ac15-4f9c-a27b-2be7231344bf]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-PRIMARY-SOURCE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_UAT/PRIMARY_SOURCE"]: Refreshing state... [id=moh_applications/client/3f1fc7bd-2f6b-43e8-8564-0e2276fc9f41/scope-mappings/045f3224-9637-4785-a661-fc6f028804d2/9ce4e013-c2b7-4379-a46e-1c6b495803a6]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-REGADMIN.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_SIT/REG_ADMIN"]: Refreshing state... [id=9de738bd-9cd8-4858-9262-024b2b871eb5/2d61a029-76fa-4abc-a07d-b07caac5a438]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-PRIMARY-SOURCE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_CONF/PRIMARY_SOURCE"]: Refreshing state... [id=moh_applications/client/3f1fc7bd-2f6b-43e8-8564-0e2276fc9f41/scope-mappings/c0fe2e9f-6937-4ffa-9296-d786d9b0a98b/7430c88e-e4e4-4bbd-b262-d4c9bc3ba564]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-PRIMARY-SOURCE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_IAT/PRIMARY_SOURCE"]: Refreshing state... [id=moh_applications/client/3f1fc7bd-2f6b-43e8-8564-0e2276fc9f41/scope-mappings/a837283e-f96e-446d-9c51-5ac7d0eab773/895c4a65-e67d-4657-bba3-df5a1440fc58]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-PRIMARY-SOURCE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_REV/PRIMARY_SOURCE"]: Refreshing state... [id=moh_applications/client/3f1fc7bd-2f6b-43e8-8564-0e2276fc9f41/scope-mappings/20e896f4-bf43-43ed-9441-d166e0513f34/4b919d71-c76b-4621-be50-f05a7e8ed144]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-REGADMIN.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_UAT/REG_ADMIN"]: Refreshing state... [id=9de738bd-9cd8-4858-9262-024b2b871eb5/620734a9-4036-47f9-8cf6-64e9698f004e]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-REGADMIN.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_IAT/REG_ADMIN"]: Refreshing state... [id=9de738bd-9cd8-4858-9262-024b2b871eb5/d1edf467-3b43-45a5-be8d-482d1c0dd3ef]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-REGADMIN.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_CONF/REG_ADMIN"]: Refreshing state... [id=9de738bd-9cd8-4858-9262-024b2b871eb5/92a2dc0e-0595-4d15-b5a3-87e56140e441]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-REGADMIN.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_REV/REG_ADMIN"]: Refreshing state... [id=9de738bd-9cd8-4858-9262-024b2b871eb5/eac35713-072d-4453-9ef1-084ea6e54eda]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_TEST.module.moh_applications.module.HCIM-BCMI.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "HCIM-BCMI"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Healthcare Client Identity Management - Vancouver Island Health Authority"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.HCIM-BCMI.keycloak_openid_hardcoded_claim_protocol_mapper.hcim_org will be created
  + resource "keycloak_openid_hardcoded_claim_protocol_mapper" "hcim_org" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + add_to_userinfo     = true
      + claim_name          = "hcim_org"
      + claim_value         = "organization/%client_id%"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "hcim_org"
      + realm_id            = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.HCIM-BCMI.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["default-roles-moh_applications"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "default-roles-moh_applications"
      + service_account_user_id = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @alex-tremblay-cgi, Action: `pull_request`*